In [1]:
import pandas as pd

In [8]:
countries = pd.Series(['Polska', 'Francja', 'Niemcy'], 
                      index=['PL', 'FR', 'DE'])
countries

PL     Polska
FR    Francja
DE     Niemcy
dtype: object

In [9]:
type(countries.values), countries.values

(numpy.ndarray, array(['Polska', 'Francja', 'Niemcy'], dtype=object))

In [10]:
countries.iloc[0]

'Polska'

In [12]:
countries.loc['PL']

'Polska'

In [21]:
df = pd.read_csv('emps.csv', sep=';', parse_dates=['hire_date'])
df

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
0,100,Steven,King,President,24000,1997-06-17,Executive,2004 Charade Rd,98199,Seattle,United States of America
1,101,Neena,Kochhar,Administration Vice President,17000,1999-09-21,Executive,2004 Charade Rd,98199,Seattle,United States of America
2,102,Lex,De Haan,Administration Vice President,17000,2003-01-13,Executive,2004 Charade Rd,98199,Seattle,United States of America
3,103,Alexander,Hunold,Programmer,9000,2000-01-03,IT,2014 Jabberwocky Rd,26192,Southlake,United States of America
4,104,Bruce,Ernst,Programmer,6000,2001-05-21,IT,2014 Jabberwocky Rd,26192,Southlake,United States of America
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,Marketing Representative,6000,2007-08-17,Marketing,147 Spadina Ave,M5V 2L7,Toronto,Canada
103,203,Susan,Mavris,Human Resources Representative,6500,2004-06-07,Human Resources,8204 Arthur St,NaN,London,United Kingdom
104,204,Hermann,Baer,Public Relations Representative,10000,2004-06-07,Public Relations,Schwanthalerstr. 7031,80925,Munich,Germany
105,205,Shelley,Higgins,Accounting Manager,12000,2004-06-07,Accounting,2004 Charade Rd,98199,Seattle,United States of America
106,206,William,Gietz,Public Accountant,8300,2004-06-07,Accounting,2004 Charade Rd,98199,Seattle,United States of America

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   employee_id      107 non-null    int64
 1   first_name       107 non-null    object
 2   last_name        107 non-null    object
 3   job_title        107 non-null    object
 4   salary           107 non-null    int64
 5   hire_date        107 non-null    datetime64[ns]
 6   department_name  106 non-null    object
 7   address          106 non-null    object
 8   postal_code      105 non-null    object
 9   city             106 non-null    object
 10  country          106 non-null    object
dtypes: datetime64[ns](1), int64(2), object(8)
memory usage: 9.3+ KB

In [25]:
df.describe(include='all')

/var/folders/__/0gvd5dsj22b9cbv4hzvln3pw0000gn/T/ipykernel_22191/2884002236.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe(include='all')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
count,107.000000,107,107,107,107.000000,107,106,106,105,106,106
unique,NaN,91,102,19,NaN,99,11,7,6,7,4
top,NaN,Peter,King,Sales Representative,NaN,2004-06-07 00:00:00,Shipping,2011 Interiors Blvd,99236,South San Francisco,United States of America
freq,NaN,3,2,30,NaN,4,45,45,45,45,68
first,NaN,NaN,NaN,NaN,NaN,1987-09-17 00:00:00,NaN,NaN,NaN,NaN,NaN
last,NaN,NaN,NaN,NaN,NaN,2011-02-06 00:00:00,NaN,NaN,NaN,NaN,NaN
mean,153.000000,NaN,NaN,NaN,6461.682243,NaN,NaN,NaN,NaN,NaN,NaN
std,31.032241,NaN,NaN,NaN,3909.365746,NaN,NaN,NaN,NaN,NaN,NaN
min,100.000000,NaN,NaN,NaN,2100.000000,NaN,NaN,NaN,NaN,NaN,NaN
25%,126.500000,NaN,NaN,NaN,3100.000000,NaN,NaN,NaN,NaN,NaN,NaN
50%,153.000000,NaN,NaN,NaN,6200.000000,NaN,NaN,NaN,NaN,NaN,NaN
75%,179.500000,NaN,NaN,NaN,8900.000000,NaN,NaN,NaN,NaN,NaN,NaN
max,206.000000,NaN,NaN,NaN,24000.000000,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
for row_id, emp in df.iterrows():
    print(row_id, emp['first_name'])

0 Steven
1 Neena
2 Lex
3 Alexander
4 Bruce
5 David
6 Valli
7 Diana
8 Nancy
9 Daniel
10 John
11 Ismael
12 Jose Manuel
13 Luis
14 Den
15 Alexander
16 Shelli
17 Sigal
18 Guy
19 Karen
20 Matthew
21 Adam
22 Payam
23 Shanta
24 Kevin
25 Julia
26 Irene
27 James
28 Steven
29 Laura
30 Mozhe
31 James
32 TJ
33 Jason
34 Michael
35 Ki
36 Hazel
37 Renske
38 Stephen
39 John
40 Joshua
41 Trenna
42 Curtis
43 Randall
44 Peter
45 John
46 Karen
47 Alberto
48 Gerald
49 Eleni
50 Peter
51 David
52 Peter
53 Christopher
54 Nanette
55 Oliver
56 Janette
57 Patrick
58 Allan
59 Lindsey
60 Louise
61 Sarath
62 Clara
63 Danielle
64 Mattea
65 David
66 Sundar
67 Amit
68 Lisa
69 Harrison
70 Tayler
71 William
72 Elizabeth
73 Sundita
74 Ellen
75 Alyssa
76 Jonathon
77 Jack
78 Kimberely
79 Charles
80 Winston
81 Jean
82 Martha
83 Girard
84 Nandita
85 Alexis
86 Julia
87 Anthony
88 Kelly
89 Jennifer
90 Timothy
91 Randall
92 Sarah
93 Britney
94 Samuel
95 Vance
96 Alana
97 Kevin
98 Donald
99 Douglas
100 Jennifer
101 Michael
102 Pat
103 Susan
104 Hermann
105 Shelley
106 William

In [31]:
df['city'] == 'Oxford'

0      False
1      False
2      False
3      False
4      False
       ...
102    False
103    False
104    False
105    False
106    False
Name: city, Length: 107, dtype: bool

In [32]:
df[df['city'] == 'Oxford']

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
50,150,Peter,Tucker,Sales Representative,10000,2007-01-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
51,151,David,Bernstein,Sales Representative,9500,2007-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
52,152,Peter,Hall,Sales Representative,9000,2007-08-20,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
53,153,Christopher,Olsen,Sales Representative,8000,2008-03-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
54,154,Nanette,Cambrault,Sales Representative,7500,2008-12-09,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
55,155,Oliver,Tuvault,Sales Representative,7000,2009-11-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
56,156,Janette,King,Sales Representative,10000,2006-01-30,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
57,157,Patrick,Sully,Sales Representative,9500,2006-03-04,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
58,158,Allan,McEwen,Sales Representative,9000,2006-08-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
59,159,Lindsey,Smith,Sales Representative,8000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
60,160,Louise,Doran,Sales Representative,7500,2007-12-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
61,161,Sarath,Sewall,Sales Representative,7000,2008-11-03,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
63,163,Danielle,Greene,Sales Representative,9500,2009-03-19,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
64,164,Mattea,Marvins,Sales Representative,7200,2010-01-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
65,165,David,Lee,Sales Representative,6800,2000-02-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
66,166,Sundar,Ande,Sales Representative,6400,2000-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
67,167,Amit,Banda,Sales Representative,6200,2000-04-21,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
69,169,Harrison,Bloom,Sales Representative,10000,2008-03-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
70,170,Tayler,Fox,Sales Representative,9600,2008-01-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
71,171,William,Smith,Sales Representative,7400,2009-02-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
72,172,Elizabeth,Bates,Sales Representative,7300,2009-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
73,173,Sundita,Kumar,Sales Representative,6100,2010-04-21,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
75,175,Alyssa,Hutton,Sales Representative,8800,2007-03-19,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
76,176,Jonathon,Taylor,Sales Representative,8600,2008-03-24,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
77,177,Jack,Livingston,Sales Representative,8400,2008-04-23,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
79,179,Charles,Johnson,Sales Representative,6200,2011-01-04,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [34]:
df.query('city == "Oxford" and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [36]:
my_city = 'Oxford'
df.query('city == @my_city and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [40]:
my_city = 'Oxford'
df.query(f'city == "{my_city}" and salary > 10000')

,employee_id,first_name,last_name,job_title,salary,hire_date,department_name,address,postal_code,city,country
45,145,John,Russell,Sales Manager,14000,2006-10-01,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
46,146,Karen,Partners,Sales Manager,13500,2007-01-05,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
47,147,Alberto,Errazuriz,Sales Manager,12000,2007-03-10,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
48,148,Gerald,Cambrault,Sales Manager,11000,2009-10-15,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
49,149,Eleni,Zlotkey,Sales Manager,10500,2000-01-29,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
62,162,Clara,Vishney,Sales Representative,10500,2007-11-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
68,168,Lisa,Ozer,Sales Representative,11500,2007-03-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom
74,174,Ellen,Abel,Sales Representative,11000,2006-05-11,Sales,"Magdalen Centre, The Oxford Science Park",OX9 9ZB,Oxford,United Kingdom

In [50]:
# https://towardsdatascience.com/pandas-dtype-specific-operations-accessors-c749bafb30a4
# https://pandas.pydata.org/docs/reference/api/pandas.Series.str.capitalize.html
df.first_name.str.upper()  # akcesor / accessor

0         STEVEN
1          NEENA
2            LEX
3      ALEXANDER
4          BRUCE
         ...
102          PAT
103        SUSAN
104      HERMANN
105      SHELLEY
106      WILLIAM
Name: first_name, Length: 107, dtype: object

In [47]:
# https://pandas.pydata.org/docs/reference/api/pandas.Series.dt.date.html
df.hire_date.dt.year

0      1997
1      1999
2      2003
3      2000
4      2001
       ...
102    2007
103    2004
104    2004
105    2004
106    2004
Name: hire_date, Length: 107, dtype: int64

In [53]:
url = 'https://alx.piotr.gg/python/sales-records.csv'
df = pd.read_csv(url)
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,South Africa,Fruits,Offline,M,7/27/2012,443368995,7/28/2012,1593,9.33,6.92,14862.69,11023.56,3839.13
1,Middle East and North Africa,Morocco,Clothes,Online,M,9/14/2013,667593514,10/19/2013,4611,109.28,35.84,503890.08,165258.24,338631.84
2,Australia and Oceania,Papua New Guinea,Meat,Offline,M,5/15/2015,940995585,6/4/2015,360,421.89,364.69,151880.40,131288.40,20592.00
3,Sub-Saharan Africa,Djibouti,Clothes,Offline,H,5/17/2017,880811536,7/2/2017,562,109.28,35.84,61415.36,20142.08,41273.28
4,Europe,Slovakia,Beverages,Offline,L,10/26/2016,174590194,12/4/2016,3973,47.45,31.79,188518.85,126301.67,62217.18
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
999995,Sub-Saharan Africa,Senegal,Baby Food,Offline,L,11/6/2010,575470578,12/11/2010,3387,255.28,159.42,864633.36,539955.54,324677.82
999996,Central America and the Caribbean,Panama,Office Supplies,Offline,C,1/12/2015,766942107,3/1/2015,4068,651.21,524.96,2649122.28,2135537.28,513585.00
999997,Europe,Norway,Office Supplies,Online,M,10/25/2011,685472047,12/5/2011,5266,651.21,524.96,3429271.86,2764439.36,664832.50
999998,Europe,Montenegro,Beverages,Offline,M,10/31/2010,946734225,12/8/2010,8551,47.45,31.79,405744.95,271836.29,133908.66
999999,Central America and the Caribbean,Nicaragua,Meat,Online,C,3/17/2015,886714971,4/8/2015,7519,421.89,364.69,3172190.91,2742104.11,430086.80